; domain
(define (domain lec-winter-split)
    (:requirements :strips :typing :equality :negative-preconditions)
    
    (:types 
        match team referee server slot - object
    )
    
    (:constants 
        home away - slot 
    )

    (:predicates
        ;; Topología del torneo
        (connected ?m1 - match ?m2 - match ?s - slot)
        (participant ?t - team ?m - match ?s - slot)
        
        ;; Estado del Partido
        (scheduled ?m - match)          ;; Partido en lobby/champ select
        (played ?m - match)             ;; La partida terminó (nexus explota)
        (result-reported ?m - match)    ;; El arbitro firmó el acta
        (verified ?m - match)           ;; La liga validó el resultado final
        (winner-determined ?m - match)  ;; Hay un ganador oficial
        (winner ?m - match ?t - team)
        
        ;; Gestión de Conflictos e Incidencias
        (has-conflict ?m - match)       ;; PREDICADO ESTÁTICO: Indica que este match "está gafado" y fallará
        (protest-active ?m - match)     ;; Hay una pausa/protesta en curso
        (protest-handled ?m - match)    ;; La protesta se resolvió (se mantiene el resultado)
        
        ;; Recursos
        (ref-available ?r - referee)
        (server-available ?s - server)
        (referee-assigned ?r - referee ?m - match)
    )

    ;; --- FASE 1: PREPARACIÓN ---

    (:action start-champ-select
        :parameters (?m - match ?s - server ?t1 - team ?t2 - team)
        :precondition (and 
            (participant ?t1 ?m home)
            (participant ?t2 ?m away)
            (not (scheduled ?m))
            (not (winner-determined ?m))
            (server-available ?s)
        )
        :effect (and 
            (scheduled ?m)
            (not (server-available ?s)) ;; Ocupamos servidor
        )
    )

    ;; --- FASE 2: EJECUCIÓN (JUGAR) ---

    ;; Opción A: Partida Limpia (Solo si NO hay conflicto predefinido)
    (:action play-clean-game
        :parameters (?m - match ?s - server ?r - referee)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (ref-available ?r)
            (not (has-conflict ?m)) ;; Condición clave: Solo si no está "gafado"
        )
        :effect (and 
            (played ?m)
            (server-available ?s)      ;; Liberamos server al acabar
            (not (ref-available ?r))   ;; Ocupamos árbitro para el acta
            (referee-assigned ?r ?m)
        )
    )

    ;; Opción B: Partida con Bug (Obligatoria si hay conflicto predefinido)
    (:action play-with-technical-issue
        :parameters (?m - match ?s - server ?r - referee)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (ref-available ?r)
            (has-conflict ?m)       ;; Condición clave: El planificador DEBE elegir esta
        )
        :effect (and 
            (played ?m)
            (protest-active ?m)     ;; Se activa la incidencia
            (server-available ?s)   ;; Liberamos server
            (not (ref-available ?r))
            (referee-assigned ?r ?m)
        )
    )

    ;; --- FASE 3: RESOLUCIÓN DE INCIDENCIAS ---

    ;; Resolución 1: Ruling Confirm (El bug no afecta, seguimos)
    (:action adjudicate-ruling-confirm
        :parameters (?m - match ?r - referee)
        :precondition (and 
            (protest-active ?m)
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (not (protest-active ?m))
            (protest-handled ?m)
        )
    )

    ;; Resolución 2: Chronobreak/Replay (Borramos lo jugado)
    (:action adjudicate-chronobreak-replay
        :parameters (?m - match ?r - referee)
        :precondition (and 
            (protest-active ?m)
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (not (protest-active ?m))
            (not (played ?m))           ;; OJO: Reseteamos estado
            (not (has-conflict ?m))     ;; ASUNCIÓN: El replay arregla el bug (evita bucles infinitos)
            (not (referee-assigned ?r ?m))
            (ref-available ?r)          ;; Liberamos al árbitro para que vuelva a empezar
            ;; El partido sigue (scheduled ?m), así que se puede volver a jugar
        )
    )

    ;; --- FASE 4: ACTA Y VERIFICACIÓN ---

    ;; El árbitro firma el acta
    (:action sign-match-sheet
        :parameters (?m - match ?t - team ?r - referee)
        :precondition (and 
            (played ?m)
            (participant ?t ?m home) ;; Simplificación: Asumimos que gana HOME (para que el planner elija)
            (not (result-reported ?m))
            (not (protest-active ?m))
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (result-reported ?m)
            (winner ?m ?t)
            (not (referee-assigned ?r ?m))
            (ref-available ?r) ;; Liberamos al árbitro
        )
    )

    ;; La liga verifica el resultado (Burocracia final)
    (:action verify-result
        :parameters (?m - match)
        :precondition (and 
            (result-reported ?m)
            (not (verified ?m))
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
        )
    )

    ;; --- OPCIÓN ESPECIAL: NO-SHOW (Sanción) ---
    (:action declare-noshow
        :parameters (?m - match ?t - team)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (participant ?t ?m home) ;; O away, el planner decide quién gana por incomparecencia
        )
        :effect (and 
            (played ?m)
            (result-reported ?m)
            (winner ?m ?t)
            (verified ?m)
            (winner-determined ?m)
            ;; Si usamos esta acción, asumimos que liberamos recursos implícitamente
        )
    )

    ;; --- FASE 5: AVANCE DE BRACKET ---

    (:action promote-to-next-round
        :parameters (?m_src - match ?m_dst - match ?t - team ?s - slot)
        :precondition (and 
            (winner-determined ?m_src)
            (winner ?m_src ?t)
            (connected ?m_src ?m_dst ?s)
        )
        :effect (and 
            (participant ?t ?m_dst ?s)
        )
    )
)

; problem
(define (problem lec-32-R4-S4-P0)
    (:domain lec-winter-split)
    (:objects
        team-1 team-2 team-3 team-4 team-5 team-6 team-7 team-8 team-9 team-10 team-11 team-12 team-13 team-14 team-15 team-16 team-17 team-18 team-19 team-20 team-21 team-22 team-23 team-24 team-25 team-26 team-27 team-28 team-29 team-30 team-31 team-32 - team
        m1 m2 m3 m4 m5 m6 m7 m8 m9 m10 m11 m12 m13 m14 m15 m16 m17 m18 m19 m20 m21 m22 m23 m24 m25 m26 m27 m28 m29 m30 m31 - match
        ref-1 ref-2 ref-3 ref-4 - referee
        server-1 server-2 server-3 server-4 - server
    )
    (:init
        (ref-available ref-1)
        (ref-available ref-2)
        (ref-available ref-3)
        (ref-available ref-4)
        (server-available server-1)
        (server-available server-2)
        (server-available server-3)
        (server-available server-4)
        (participant team-1 m1 home)
        (participant team-2 m1 away)
        (participant team-3 m2 home)
        (participant team-4 m2 away)
        (participant team-5 m3 home)
        (participant team-6 m3 away)
        (participant team-7 m4 home)
        (participant team-8 m4 away)
        (participant team-9 m5 home)
        (participant team-10 m5 away)
        (participant team-11 m6 home)
        (participant team-12 m6 away)
        (participant team-13 m7 home)
        (participant team-14 m7 away)
        (participant team-15 m8 home)
        (participant team-16 m8 away)
        (participant team-17 m9 home)
        (participant team-18 m9 away)
        (participant team-19 m10 home)
        (participant team-20 m10 away)
        (participant team-21 m11 home)
        (participant team-22 m11 away)
        (participant team-23 m12 home)
        (participant team-24 m12 away)
        (participant team-25 m13 home)
        (participant team-26 m13 away)
        (participant team-27 m14 home)
        (participant team-28 m14 away)
        (participant team-29 m15 home)
        (participant team-30 m15 away)
        (participant team-31 m16 home)
        (participant team-32 m16 away)
        (connected m1 m17 home)
        (connected m2 m17 away)
        (connected m3 m18 home)
        (connected m4 m18 away)
        (connected m5 m19 home)
        (connected m6 m19 away)
        (connected m7 m20 home)
        (connected m8 m20 away)
        (connected m9 m21 home)
        (connected m10 m21 away)
        (connected m11 m22 home)
        (connected m12 m22 away)
        (connected m13 m23 home)
        (connected m14 m23 away)
        (connected m15 m24 home)
        (connected m16 m24 away)
        (connected m17 m25 home)
        (connected m18 m25 away)
        (connected m19 m26 home)
        (connected m20 m26 away)
        (connected m21 m27 home)
        (connected m22 m27 away)
        (connected m23 m28 home)
        (connected m24 m28 away)
        (connected m25 m29 home)
        (connected m26 m29 away)
        (connected m27 m30 home)
        (connected m28 m30 away)
        (connected m29 m31 home)
        (connected m30 m31 away)
    )
    (:goal
        (verified m31)
    )
)

; plan
1. (start-champ-select m16 server-4 team-31 team-32)
   deleted: (server-available server-4)
   added: (scheduled m16)
   goals met: 0 of 1
2. (start-champ-select m5 server-3 team-9 team-10)
   deleted: (server-available server-3)
   added: (scheduled m5)
   goals met: 0 of 1
3. (declare-noshow m5 team-9)
   added: (played m5) (result-reported m5) (winner m5 team-9) (verified m5) (winner-determined m5)
   goals met: 0 of 1
4. (declare-noshow m16 team-31)
   added: (played m16) (result-reported m16) (winner m16 team-31) (verified m16) (winner-determined m16)
   goals met: 0 of 1
5. (start-champ-select m1 server-2 team-1 team-2)
   deleted: (server-available server-2)
   added: (scheduled m1)
   goals met: 0 of 1
6. (declare-noshow m1 team-1)
   added: (played m1) (result-reported m1) (winner m1 team-1) (verified m1) (winner-determined m1)
   goals met: 0 of 1
7. (start-champ-select m8 server-1 team-15 team-16)
   deleted: (server-available server-1)
   added: (scheduled m8)
   goals met: 0 of 1
8. (play-clean-game m8 server-4 ref-1)
   deleted: (ref-available ref-1)
   added: (played m8) (server-available server-4) (referee-assigned ref-1 m8)
   goals met: 0 of 1
9. (sign-match-sheet m8 team-15 ref-1)
   deleted: (referee-assigned ref-1 m8)
   added: (result-reported m8) (winner m8 team-15) (ref-available ref-1)
   goals met: 0 of 1
10. (start-champ-select m2 server-4 team-3 team-4)
   deleted: (server-available server-4)
   added: (scheduled m2)
   goals met: 0 of 1
11. (play-clean-game m2 server-2 ref-4)
   deleted: (ref-available ref-4)
   added: (played m2) (server-available server-2) (referee-assigned ref-4 m2)
   goals met: 0 of 1
12. (sign-match-sheet m2 team-3 ref-4)
   deleted: (referee-assigned ref-4 m2)
   added: (result-reported m2) (winner m2 team-3) (ref-available ref-4)
   goals met: 0 of 1
13. (verify-result m8)
   added: (verified m8) (winner-determined m8)
   goals met: 0 of 1
14. (verify-result m2)
   added: (verified m2) (winner-determined m2)
   goals met: 0 of 1
15. (promote-to-next-round m1 m17 team-1 home)
   added: (participant team-1 m17 home)
   goals met: 0 of 1
16. (promote-to-next-round m2 m17 team-3 away)
   added: (participant team-3 m17 away)
   goals met: 0 of 1
17. (start-champ-select m17 server-2 team-1 team-3)
   deleted: (server-available server-2)
   added: (scheduled m17)
   goals met: 0 of 1
18. (play-clean-game m17 server-2 ref-4)
   deleted: (ref-available ref-4)
   added: (played m17) (server-available server-2) (referee-assigned ref-4 m17)
   goals met: 0 of 1
19. (start-champ-select m15 server-2 team-29 team-30)
   deleted: (server-available server-2)
   added: (scheduled m15)
   goals met: 0 of 1
20. (play-clean-game m15 server-4 ref-2)
   deleted: (ref-available ref-2)
   added: (played m15) (server-available server-4) (referee-assigned ref-2 m15)
   goals met: 0 of 1
21. (sign-match-sheet m15 team-29 ref-2)
   deleted: (referee-assigned ref-2 m15)
   added: (result-reported m15) (winner m15 team-29) (ref-available ref-2)
   goals met: 0 of 1
22. (sign-match-sheet m17 team-1 ref-4)
   deleted: (referee-assigned ref-4 m17)
   added: (result-reported m17) (winner m17 team-1) (ref-available ref-4)
   goals met: 0 of 1
23. (verify-result m17)
   added: (verified m17) (winner-determined m17)
   goals met: 0 of 1
24. (start-champ-select m9 server-4 team-17 team-18)
   deleted: (server-available server-4)
   added: (scheduled m9)
   goals met: 0 of 1
25. (play-clean-game m9 server-4 ref-4)
   deleted: (ref-available ref-4)
   added: (played m9) (server-available server-4) (referee-assigned ref-4 m9)
   goals met: 0 of 1
26. (start-champ-select m14 server-4 team-27 team-28)
   deleted: (server-available server-4)
   added: (scheduled m14)
   goals met: 0 of 1
27. (verify-result m15)
   added: (verified m15) (winner-determined m15)
   goals met: 0 of 1
28. (play-clean-game m14 server-4 ref-2)
   deleted: (ref-available ref-2)
   added: (played m14) (server-available server-4) (referee-assigned ref-2 m14)
   goals met: 0 of 1
29. (sign-match-sheet m9 team-17 ref-4)
   deleted: (referee-assigned ref-4 m9)
   added: (result-reported m9) (winner m9 team-17) (ref-available ref-4)
   goals met: 0 of 1
30. (start-champ-select m13 server-4 team-25 team-26)
   deleted: (server-available server-4)
   added: (scheduled m13)
   goals met: 0 of 1
31. (play-clean-game m13 server-4 ref-1)
   deleted: (ref-available ref-1)
   added: (played m13) (server-available server-4) (referee-assigned ref-1 m13)
   goals met: 0 of 1
32. (sign-match-sheet m14 team-27 ref-2)
   deleted: (referee-assigned ref-2 m14)
   added: (result-reported m14) (winner m14 team-27) (ref-available ref-2)
   goals met: 0 of 1
33. (verify-result m14)
   added: (verified m14) (winner-determined m14)
   goals met: 0 of 1
34. (verify-result m9)
   added: (verified m9) (winner-determined m9)
   goals met: 0 of 1
35. (start-champ-select m12 server-4 team-23 team-24)
   deleted: (server-available server-4)
   added: (scheduled m12)
   goals met: 0 of 1
36. (play-clean-game m12 server-1 ref-4)
   deleted: (ref-available ref-4)
   added: (played m12) (server-available server-1) (referee-assigned ref-4 m12)
   goals met: 0 of 1
37. (sign-match-sheet m12 team-23 ref-4)
   deleted: (referee-assigned ref-4 m12)
   added: (result-reported m12) (winner m12 team-23) (ref-available ref-4)
   goals met: 0 of 1
38. (start-champ-select m11 server-1 team-21 team-22)
   deleted: (server-available server-1)
   added: (scheduled m11)
   goals met: 0 of 1
39. (play-clean-game m11 server-4 ref-3)
   deleted: (ref-available ref-3)
   added: (played m11) (server-available server-4) (referee-assigned ref-3 m11)
   goals met: 0 of 1
40. (sign-match-sheet m13 team-25 ref-1)
   deleted: (referee-assigned ref-1 m13)
   added: (result-reported m13) (winner m13 team-25) (ref-available ref-1)
   goals met: 0 of 1
41. (start-champ-select m10 server-4 team-19 team-20)
   deleted: (server-available server-4)
   added: (scheduled m10)
   goals met: 0 of 1
42. (play-clean-game m10 server-4 ref-1)
   deleted: (ref-available ref-1)
   added: (played m10) (server-available server-4) (referee-assigned ref-1 m10)
   goals met: 0 of 1
43. (start-champ-select m7 server-4 team-13 team-14)
   deleted: (server-available server-4)
   added: (scheduled m7)
   goals met: 0 of 1
44. (play-clean-game m7 server-4 ref-2)
   deleted: (ref-available ref-2)
   added: (played m7) (server-available server-4) (referee-assigned ref-2 m7)
   goals met: 0 of 1
45. (sign-match-sheet m11 team-21 ref-3)
   deleted: (referee-assigned ref-3 m11)
   added: (result-reported m11) (winner m11 team-21) (ref-available ref-3)
   goals met: 0 of 1
46. (sign-match-sheet m10 team-19 ref-1)
   deleted: (referee-assigned ref-1 m10)
   added: (result-reported m10) (winner m10 team-19) (ref-available ref-1)
   goals met: 0 of 1
47. (verify-result m13)
   added: (verified m13) (winner-determined m13)
   goals met: 0 of 1
48. (verify-result m12)
   added: (verified m12) (winner-determined m12)
   goals met: 0 of 1
49. (verify-result m11)
   added: (verified m11) (winner-determined m11)
   goals met: 0 of 1
50. (start-champ-select m6 server-4 team-11 team-12)
   deleted: (server-available server-4)
   added: (scheduled m6)
   goals met: 0 of 1
51. (verify-result m10)
   added: (verified m10) (winner-determined m10)
   goals met: 0 of 1
52. (play-clean-game m6 server-4 ref-4)
   deleted: (ref-available ref-4)
   added: (played m6) (server-available server-4) (referee-assigned ref-4 m6)
   goals met: 0 of 1
53. (start-champ-select m4 server-4 team-7 team-8)
   deleted: (server-available server-4)
   added: (scheduled m4)
   goals met: 0 of 1
54. (play-clean-game m4 server-2 ref-3)
   deleted: (ref-available ref-3)
   added: (played m4) (server-available server-2) (referee-assigned ref-3 m4)
   goals met: 0 of 1
55. (sign-match-sheet m7 team-13 ref-2)
   deleted: (referee-assigned ref-2 m7)
   added: (result-reported m7) (winner m7 team-13) (ref-available ref-2)
   goals met: 0 of 1
56. (sign-match-sheet m6 team-11 ref-4)
   deleted: (referee-assigned ref-4 m6)
   added: (result-reported m6) (winner m6 team-11) (ref-available ref-4)
   goals met: 0 of 1
57. (verify-result m7)
   added: (verified m7) (winner-determined m7)
   goals met: 0 of 1
58. (sign-match-sheet m4 team-7 ref-3)
   deleted: (referee-assigned ref-3 m4)
   added: (result-reported m4) (winner m4 team-7) (ref-available ref-3)
   goals met: 0 of 1
59. (verify-result m6)
   added: (verified m6) (winner-determined m6)
   goals met: 0 of 1
60. (verify-result m4)
   added: (verified m4) (winner-determined m4)
   goals met: 0 of 1
61. (promote-to-next-round m17 m25 team-1 home)
   added: (participant team-1 m25 home)
   goals met: 0 of 1
62. (promote-to-next-round m4 m18 team-7 away)
   added: (participant team-7 m18 away)
   goals met: 0 of 1
63. (promote-to-next-round m5 m19 team-9 home)
   added: (participant team-9 m19 home)
   goals met: 0 of 1
64. (promote-to-next-round m6 m19 team-11 away)
   added: (participant team-11 m19 away)
   goals met: 0 of 1
65. (promote-to-next-round m7 m20 team-13 home)
   added: (participant team-13 m20 home)
   goals met: 0 of 1
66. (promote-to-next-round m8 m20 team-15 away)
   added: (participant team-15 m20 away)
   goals met: 0 of 1
67. (start-champ-select m20 server-2 team-13 team-15)
   deleted: (server-available server-2)
   added: (scheduled m20)
   goals met: 0 of 1
68. (play-clean-game m20 server-4 ref-2)
   deleted: (ref-available ref-2)
   added: (played m20) (server-available server-4) (referee-assigned ref-2 m20)
   goals met: 0 of 1
69. (start-champ-select m19 server-4 team-9 team-11)
   deleted: (server-available server-4)
   added: (scheduled m19)
   goals met: 0 of 1
70. (play-clean-game m19 server-4 ref-4)
   deleted: (ref-available ref-4)
   added: (played m19) (server-available server-4) (referee-assigned ref-4 m19)
   goals met: 0 of 1
71. (start-champ-select m3 server-4 team-5 team-6)
   deleted: (server-available server-4)
   added: (scheduled m3)
   goals met: 0 of 1
72. (sign-match-sheet m19 team-9 ref-4)
   deleted: (referee-assigned ref-4 m19)
   added: (result-reported m19) (winner m19 team-9) (ref-available ref-4)
   goals met: 0 of 1
73. (play-clean-game m3 server-4 ref-3)
   deleted: (ref-available ref-3)
   added: (played m3) (server-available server-4) (referee-assigned ref-3 m3)
   goals met: 0 of 1
74. (sign-match-sheet m20 team-13 ref-2)
   deleted: (referee-assigned ref-2 m20)
   added: (result-reported m20) (winner m20 team-13) (ref-available ref-2)
   goals met: 0 of 1
75. (verify-result m20)
   added: (verified m20) (winner-determined m20)
   goals met: 0 of 1
76. (verify-result m19)
   added: (verified m19) (winner-determined m19)
   goals met: 0 of 1
77. (promote-to-next-round m19 m26 team-9 home)
   added: (participant team-9 m26 home)
   goals met: 0 of 1
78. (promote-to-next-round m20 m26 team-13 away)
   added: (participant team-13 m26 away)
   goals met: 0 of 1
79. (start-champ-select m26 server-4 team-9 team-13)
   deleted: (server-available server-4)
   added: (scheduled m26)
   goals met: 0 of 1
80. (play-clean-game m26 server-4 ref-1)
   deleted: (ref-available ref-1)
   added: (played m26) (server-available server-4) (referee-assigned ref-1 m26)
   goals met: 0 of 1
81. (sign-match-sheet m3 team-5 ref-3)
   deleted: (referee-assigned ref-3 m3)
   added: (result-reported m3) (winner m3 team-5) (ref-available ref-3)
   goals met: 0 of 1
82. (verify-result m3)
   added: (verified m3) (winner-determined m3)
   goals met: 0 of 1
83. (promote-to-next-round m3 m18 team-5 home)
   added: (participant team-5 m18 home)
   goals met: 0 of 1
84. (start-champ-select m18 server-4 team-5 team-7)
   deleted: (server-available server-4)
   added: (scheduled m18)
   goals met: 0 of 1
85. (play-clean-game m18 server-2 ref-4)
   deleted: (ref-available ref-4)
   added: (played m18) (server-available server-2) (referee-assigned ref-4 m18)
   goals met: 0 of 1
86. (sign-match-sheet m26 team-9 ref-1)
   deleted: (referee-assigned ref-1 m26)
   added: (result-reported m26) (winner m26 team-9) (ref-available ref-1)
   goals met: 0 of 1
87. (sign-match-sheet m18 team-5 ref-4)
   deleted: (referee-assigned ref-4 m18)
   added: (result-reported m18) (winner m18 team-5) (ref-available ref-4)
   goals met: 0 of 1
88. (promote-to-next-round m9 m21 team-17 home)
   added: (participant team-17 m21 home)
   goals met: 0 of 1
89. (verify-result m26)
   added: (verified m26) (winner-determined m26)
   goals met: 0 of 1
90. (verify-result m18)
   added: (verified m18) (winner-determined m18)
   goals met: 0 of 1
91. (promote-to-next-round m26 m29 team-9 away)
   added: (participant team-9 m29 away)
   goals met: 0 of 1
92. (promote-to-next-round m18 m25 team-5 away)
   added: (participant team-5 m25 away)
   goals met: 0 of 1
93. (promote-to-next-round m10 m21 team-19 away)
   added: (participant team-19 m21 away)
   goals met: 0 of 1
94. (promote-to-next-round m11 m22 team-21 home)
   added: (participant team-21 m22 home)
   goals met: 0 of 1
95. (promote-to-next-round m12 m22 team-23 away)
   added: (participant team-23 m22 away)
   goals met: 0 of 1
96. (promote-to-next-round m13 m23 team-25 home)
   added: (participant team-25 m23 home)
   goals met: 0 of 1
97. (promote-to-next-round m14 m23 team-27 away)
   added: (participant team-27 m23 away)
   goals met: 0 of 1
98. (promote-to-next-round m15 m24 team-29 home)
   added: (participant team-29 m24 home)
   goals met: 0 of 1
99. (start-champ-select m23 server-2 team-25 team-27)
   deleted: (server-available server-2)
   added: (scheduled m23)
   goals met: 0 of 1
100. (play-clean-game m23 server-4 ref-1)
   deleted: (ref-available ref-1)
   added: (played m23) (server-available server-4) (referee-assigned ref-1 m23)
   goals met: 0 of 1
101. (start-champ-select m25 server-4 team-1 team-5)
   deleted: (server-available server-4)
   added: (scheduled m25)
   goals met: 0 of 1
102. (play-clean-game m25 server-4 ref-4)
   deleted: (ref-available ref-4)
   added: (played m25) (server-available server-4) (referee-assigned ref-4 m25)
   goals met: 0 of 1
103. (start-champ-select m22 server-4 team-21 team-23)
   deleted: (server-available server-4)
   added: (scheduled m22)
   goals met: 0 of 1
104. (sign-match-sheet m23 team-25 ref-1)
   deleted: (referee-assigned ref-1 m23)
   added: (result-reported m23) (winner m23 team-25) (ref-available ref-1)
   goals met: 0 of 1
105. (verify-result m23)
   added: (verified m23) (winner-determined m23)
   goals met: 0 of 1
106. (promote-to-next-round m23 m28 team-25 home)
   added: (participant team-25 m28 home)
   goals met: 0 of 1
107. (play-clean-game m22 server-4 ref-1)
   deleted: (ref-available ref-1)
   added: (played m22) (server-available server-4) (referee-assigned ref-1 m22)
   goals met: 0 of 1
108. (start-champ-select m21 server-4 team-17 team-19)
   deleted: (server-available server-4)
   added: (scheduled m21)
   goals met: 0 of 1
109. (sign-match-sheet m25 team-1 ref-4)
   deleted: (referee-assigned ref-4 m25)
   added: (result-reported m25) (winner m25 team-1) (ref-available ref-4)
   goals met: 0 of 1
110. (play-clean-game m21 server-4 ref-4)
   deleted: (ref-available ref-4)
   added: (played m21) (server-available server-4) (referee-assigned ref-4 m21)
   goals met: 0 of 1
111. (promote-to-next-round m16 m24 team-31 away)
   added: (participant team-31 m24 away)
   goals met: 0 of 1
112. (sign-match-sheet m22 team-21 ref-1)
   deleted: (referee-assigned ref-1 m22)
   added: (result-reported m22) (winner m22 team-21) (ref-available ref-1)
   goals met: 0 of 1
113. (verify-result m25)
   added: (verified m25) (winner-determined m25)
   goals met: 0 of 1
114. (verify-result m22)
   added: (verified m22) (winner-determined m22)
   goals met: 0 of 1
115. (start-champ-select m24 server-4 team-29 team-31)
   deleted: (server-available server-4)
   added: (scheduled m24)
   goals met: 0 of 1
116. (sign-match-sheet m21 team-17 ref-4)
   deleted: (referee-assigned ref-4 m21)
   added: (result-reported m21) (winner m21 team-17) (ref-available ref-4)
   goals met: 0 of 1
117. (play-clean-game m24 server-4 ref-2)
   deleted: (ref-available ref-2)
   added: (played m24) (server-available server-4) (referee-assigned ref-2 m24)
   goals met: 0 of 1
118. (verify-result m21)
   added: (verified m21) (winner-determined m21)
   goals met: 0 of 1
119. (promote-to-next-round m25 m29 team-1 home)
   added: (participant team-1 m29 home)
   goals met: 0 of 1
120. (start-champ-select m29 server-4 team-1 team-9)
   deleted: (server-available server-4)
   added: (scheduled m29)
   goals met: 0 of 1
121. (play-clean-game m29 server-4 ref-1)
   deleted: (ref-available ref-1)
   added: (played m29) (server-available server-4) (referee-assigned ref-1 m29)
   goals met: 0 of 1
122. (sign-match-sheet m24 team-29 ref-2)
   deleted: (referee-assigned ref-2 m24)
   added: (result-reported m24) (winner m24 team-29) (ref-available ref-2)
   goals met: 0 of 1
123. (sign-match-sheet m29 team-1 ref-1)
   deleted: (referee-assigned ref-1 m29)
   added: (result-reported m29) (winner m29 team-1) (ref-available ref-1)
   goals met: 0 of 1
124. (verify-result m24)
   added: (verified m24) (winner-determined m24)
   goals met: 0 of 1
125. (promote-to-next-round m24 m28 team-29 away)
   added: (participant team-29 m28 away)
   goals met: 0 of 1
126. (start-champ-select m28 server-4 team-25 team-29)
   deleted: (server-available server-4)
   added: (scheduled m28)
   goals met: 0 of 1
127. (play-clean-game m28 server-4 ref-4)
   deleted: (ref-available ref-4)
   added: (played m28) (server-available server-4) (referee-assigned ref-4 m28)
   goals met: 0 of 1
128. (verify-result m29)
   added: (verified m29) (winner-determined m29)
   goals met: 0 of 1
129. (promote-to-next-round m29 m31 team-1 home)
   added: (participant team-1 m31 home)
   goals met: 0 of 1
130. (sign-match-sheet m28 team-25 ref-4)
   deleted: (referee-assigned ref-4 m28)
   added: (result-reported m28) (winner m28 team-25) (ref-available ref-4)
   goals met: 0 of 1
131. (verify-result m28)
   added: (verified m28) (winner-determined m28)
   goals met: 0 of 1
132. (promote-to-next-round m28 m30 team-25 away)
   added: (participant team-25 m30 away)
   goals met: 0 of 1
133. (promote-to-next-round m21 m27 team-17 home)
   added: (participant team-17 m27 home)
   goals met: 0 of 1
134. (promote-to-next-round m22 m27 team-21 away)
   added: (participant team-21 m27 away)
   goals met: 0 of 1
135. (start-champ-select m27 server-4 team-17 team-21)
   deleted: (server-available server-4)
   added: (scheduled m27)
   goals met: 0 of 1
136. (play-clean-game m27 server-4 ref-4)
   deleted: (ref-available ref-4)
   added: (played m27) (server-available server-4) (referee-assigned ref-4 m27)
   goals met: 0 of 1
137. (sign-match-sheet m27 team-17 ref-4)
   deleted: (referee-assigned ref-4 m27)
   added: (result-reported m27) (winner m27 team-17) (ref-available ref-4)
   goals met: 0 of 1
138. (verify-result m27)
   added: (verified m27) (winner-determined m27)
   goals met: 0 of 1
139. (promote-to-next-round m27 m30 team-17 home)
   added: (participant team-17 m30 home)
   goals met: 0 of 1
140. (start-champ-select m30 server-4 team-17 team-25)
   deleted: (server-available server-4)
   added: (scheduled m30)
   goals met: 0 of 1
141. (play-clean-game m30 server-2 ref-4)
   deleted: (ref-available ref-4)
   added: (played m30) (server-available server-2) (referee-assigned ref-4 m30)
   goals met: 0 of 1
142. (sign-match-sheet m30 team-17 ref-4)
   deleted: (referee-assigned ref-4 m30)
   added: (result-reported m30) (winner m30 team-17) (ref-available ref-4)
   goals met: 0 of 1
143. (verify-result m30)
   added: (verified m30) (winner-determined m30)
   goals met: 0 of 1
144. (promote-to-next-round m30 m31 team-17 away)
   added: (participant team-17 m31 away)
   goals met: 0 of 1
145. (start-champ-select m31 server-2 team-1 team-17)
   deleted: (server-available server-2)
   added: (scheduled m31)
   goals met: 0 of 1
146. (declare-noshow m31 team-1)
   added: (played m31) (result-reported m31) (winner m31 team-1) (verified m31) (winner-determined m31)
   goals met: 1 of 1
